app/views/comments/_comment.html.erb

  commented by <strong><%= link_to(comment.user.login, user_path(comment.user)) %></strong>
  at <strong><%= comment.created_at.strftime("%b'%e %Y %H:%M") %></strong><br />
---
INSERT INTO "comments" ("updated_at", "created_at", "description", "user_id", "article_id") VALUES ('2011-06-06 10:26:37.865715', '2011-06-06 10:26:37.865715', 'vc b,dhj.fjk/lk/.hgnREHEtrnhrtn', 1, 1)