app/views/articles/_article.html.erb

  <strong class="votes_against"><%= article.votes.against.count %></strong> <%= link_to("Vote against Article", "javascript: void(0);", :class => 'vote_against') %> |
  <strong class="comments"><%= article.comments.count %></strong> <%= link_to("Comment on Article", user_article_path(article.user, article)) %><br /><br />
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "comments" WHERE ("comments".article_id = 1)