app/views/articles/_form.html.erb

  <div class="field">
    <%= f.select :category_id, options_from_collection_for_select(current_user.categories, "id", "title", :selected => @selected_category) %> |
---
SELECT "categories".* FROM "categories" WHERE ("categories".user_id = 1)