app/views/articles/show.html.erb


<h3><strong class="comments_counter"><%= @article.comments.count %></strong> Comments: </h3>
---
SELECT "comments".* FROM "comments" WHERE ("comments".article_id = 1)
SELECT COUNT(*) FROM "comments" WHERE ("comments".article_id = 1)