app/controllers/articles_controller.rb

  def new
    @categories = Category.all
---
SELECT "categories".* FROM "categories" WHERE ("categories".user_id = 1)

  def edit
    @article = current_user.articles.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 AND ("articles".user_id = 1) LIMIT 1

  def create
    @article = current_user.articles.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("user_id", "title", "source", "created_at", "description", "category_id", "updated_at") VALUES (1, 'Hockey', 'www.google.com', '2011-06-06 10:26:30.421557', '<p><em>cv nvb mbn,mn zbgzfgbartntrngn ggfb </em></p>', 1, '2011-06-06 10:26:30.421557')