app/controllers/categories_controller.rb

  def new
    @user = current_user
    @category = current_user.categories.new(:user_id => current_user.id)
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = current_user.categories.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("updated_at", "created_at", "title", "user_id") VALUES ('2011-06-06 10:25:36.001670', '2011-06-06 10:25:36.001670', 'Sport', 1)