app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
INSERT INTO "comments" ("updated_at", "created_at", "description", "user_id", "article_id") VALUES ('2011-06-06 10:26:37.865715', '2011-06-06 10:26:37.865715', 'vc b,dhj.fjk/lk/.hgnREHEtrnhrtn', 1, 1)
---
  def create
    if params[:article_id].present?
      article = Article.find(params[:article_id])
      if article.present?
        current_user.comments.create(:article_id => article.id, :description => params[:description])