app/controllers/home_controller.rb

  def index
    @articles = Article.order("created_at").page(params[:page]).per(3)
---
SELECT "articles".* FROM "articles" ORDER BY created_at LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "articles" LIMIT 3 OFFSET 0