app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "birthday" = '1985-07-11', "updated_at" = '2011-06-06 10:27:32.986562' WHERE "users"."id" = 1