app/controllers/votes_controller.rb

  def create
    if params[:article_id].present?
      article = Article.find(params[:article_id])
      if article.present?
        if current_user.votes.where(:article_id => article.id).present?
          @voted = true
        else
          current_user.votes.create(:article_id => article.id, :result => params[:result])
          if params[:result] == 'for'
            @votes_for = article.votes.for.where(:article_id => article.id).count
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
INSERT INTO "votes" ("user_id", "article_id", "updated_at", "result", "created_at") VALUES (1, 1, '2011-06-06 10:27:03.673293', 'against', '2011-06-06 10:27:03.673293')
SELECT COUNT(*) FROM "votes" WHERE "votes"."result" = 'against' AND "votes"."article_id" = 1 AND ("votes".article_id = 1)